We are having a similar issue. We have a module that provides some "syntactic sugar" to make it easier to create multiple role assignments at a given scope. In several instances, plans consistently insist on replacing the role assignments with what end up being identical role assignments. We have tried the work-around of using an intermediate local to no avail as shown below.

Relevant snippet of the original module code:
`# AD groups to be granted RBAC roles on the given scope
data "azuread_group" "group_list" {
  for_each     = var.rbacs.groups

  display_name = each.value.name
}

# The group role assignments
resource "azurerm_role_assignment" "group_role_assignments" {
  for_each             = var.rbacs.groups

  scope                = var.scope
  description          = each.key
  role_definition_name = each.value.role
  principal_id         = data.azuread_group.group_list[each.key].object_id   ///*** this is the property that the plan says forces replacement!
}`

We have tried both of the following to "insert" locals and are still getting the exact same results. These are basically a shallow copy and then a deep property extract of the data block results. Shallow copy version first:
`# AD groups to be granted RBAC roles on the storage account
data "azuread_group" "group_list" {
  for_each     = var.rbacs.groups

  display_name = each.value.name
}

locals {
  groups   = { for k, v in data.azuread_group.group_list : k => v }
}

# The group role assignments
resource "azurerm_role_assignment" "group_role_assignments" {
  for_each             = var.rbacs.groups

  scope                          = var.scope
  description                 = each.key
  role_definition_name = each.value.role
  principal_id                = local.groups[each.key].object_id   // this still forces replacement
}`

Also we tried this local that extracts just the field we care about a-priori - with the same results:
`# AD groups to be granted RBAC roles on the storage account
data "azuread_group" "group_list" {
  for_each     = var.rbacs.groups

  display_name = each.value.name
}

locals {
  group_ids   = { for k, v in data.azuread_group.group_list : k => v.object_id}
}

# The group role assignments
resource "azurerm_role_assignment" "group_role_assignments" {
  for_each             = var.rbacs.groups

  scope                = var.scope
  description          = each.key
  role_definition_name = each.value.role
  principal_id         = local.group_ids[each.key]   // This still forces replacement
}`

Note that in all cases, we are acquiring the scope from another terraform object (resource, data, or module block) and it always has the "/" on the front as noted by KonTheCat. So that is not our issue either.

Plan output is consistent. For example:
`  # module.funcs["dataproc"].module.app-service_role_assignments.azurerm_role_assignment.group_role_assignments["dop_devadmins"] must be replaced
-/+ resource "azurerm_role_assignment" "group_role_assignments" {
      ~ id                               = "/subscriptions/d2bbed83-76ea-431a-b56b-5bee360187a9/resourceGroups/RGP-MEF-DOP-EAST-D/providers/Microsoft.Web/sites/fnc-dopadf-eastus-d/providers/Microsoft.Authorization/roleAssignments/45e51cf9-07f7-ad6c-8e65-c4a107f1a38b" -> (known after apply)
      ~ name                             = "45e51cf9-07f7-ad6c-8e65-c4a107f1a38b" -> (known after apply)
      ~ principal_id                     = "97b1cf2e-fff5-4748-86b6-baea46f47086" # forces replacement -> (known after apply) # forces replacement
      ~ principal_type                   = "Group" -> (known after apply)
      ~ role_definition_id               = "/subscriptions/d2bbed83-76ea-431a-b56b-5bee360187a9/providers/Microsoft.Authorization/roleDefinitions/2cc479cb-7b4d-49a8-b449-8c00fd0f0a4b" -> (known after apply)
      + skip_service_principal_aad_check = (known after apply)
        # (3 unchanged attributes hidden)
    }
`
